IDEA StatiCa Open Model
CrossSectionFactory.FillShapeU Method
Compatible with IDEA StatiCa Beta 21.0 - beta
 Creates a U shape of css.
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public static void FillShapeU(
	CrossSectionParameter css,
	double bt,
	double bb,
	double h,
	double tb,
	double tl,
	double tr
)
Public Shared Sub FillShapeU (
	css As CrossSectionParameter,
	bt As Double,
	bb As Double,
	h As Double,
	tb As Double,
	tl As Double,
	tr As Double
)
public:
static void FillShapeU(
	CrossSectionParameter^ css,
	double bt,
	double bb,
	double h,
	double tb,
	double tl,
	double tr
)
Parameters
css
Type: IdeaRS.OpenModel.CrossSection.CrossSectionParameter
Parameters of CrossSectionParameter will be filled
bt
Type: System.Double
The width of U top flange.
bb
Type: System.Double
The width of U bottom flange.
h
Type: System.Double
The height of U shape.
tb
Type: System.Double
The bottom deck thickness.
tl
Type: System.Double
The left deck thickness.
tr
Type: System.Double
The right deck thickness.
See Also
Reference
CrossSectionFactory Class
IdeaRS.OpenModel.CrossSection Namespace